In [1]:
import numpy as np
import pandas as pd

data = pd.Series(np.random.randn(9),
                index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                       [1, 2, 3, 1, 2, 3, 1, 2, 3]])
data

a  1   -0.397874
   2   -0.603857
   3    0.215817
b  1   -0.636190
   2    0.800848
c  3    1.787896
   1    0.258309
d  2   -0.107083
   3    0.014144
dtype: float64

In [2]:
data.unstack()

          1         2         3
a -0.397874 -0.603857  0.215817
b -0.636190  0.800848       NaN
c  0.258309       NaN  1.787896
d       NaN -0.107083  0.014144

In [4]:
data.unstack(0)

          a         b         c         d
1 -0.397874 -0.636190  0.258309       NaN
2 -0.603857  0.800848       NaN -0.107083
3  0.215817       NaN  1.787896  0.014144